app/controllers/api/v1/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
---
def index
    @messages = Message.all